
Процедура ПередЗаписью(Отказ)
	//
	//Попытка
	//	НпользовательИБ = ПользователиИнформационнойБазы.СоздатьПользователя();
	//	НпользовательИБ.Имя = СтрЗаменить(Наименование," ","");
	//	НпользовательИБ.ПолноеИмя = СтрЗаменить(Наименование," ","");
	//	НпользовательИБ.Роли.Добавить(Метаданные.Роли.Администратор);
	//	НпользовательИБ.Записать();
	//	ИдентификаторПользователяИБ = Строка(НпользовательИБ.УникальныйИдентификатор);
	//	//Записать();
	//Исключение
	//	Отказ = Истина;
	//	Ошибка = ОписаниеОшибки();
	//	Сообщить(Ошибка);
	//КонецПопытки;
	//
КонецПроцедуры
